### What are pandas? 

Cute little oreo bears. ðŸ¼

Also, one of the most important libraries in python when dealing with DATA.

### Pandas Objectives
- Get to know the fundamental data types in pandas
- Get to know the "pandas syntax"
- Check out some basic data frame operations

*****

- Advanced techniques (groupby, merges, pivot)
- Plotting data

In [ ]:
!pip3 install pandas

In [1]:
import pandas as pd

In [2]:
?pd

In [4]:
## Series
sr = pd.Series([1,2,3,4,5,6])

In [5]:
sr

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [6]:
type(sr)

pandas.core.series.Series

In [7]:
sr[5]

6

In [9]:
sr.index

RangeIndex(start=0, stop=6, step=1)

In [10]:
sr.index = ["a","b","c","d","e","f"]

In [11]:
sr

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [13]:
print(sr.name)

None

In [15]:
sr.name = "Numbers"

In [16]:
sr

a    1
b    2
c    3
d    4
e    5
f    6
Name: Numbers, dtype: int64

In [21]:
data= {"name":"Num","index":["a","b","c","d","e","f"],
                 "data":[1,2,3,4,5,6]}
sr2 = pd.Series(**data)

In [ ]:
## Using ** to unpack keyword arguments means we are calling function as:
pd.Series(name="Num",index=["a","b","c","d","e","f"],data=[1,2,3,4,5,6])

In [22]:
sr2

a    1
b    2
c    3
d    4
e    5
f    6
Name: Num, dtype: int64

## Accesing values of a Series:

In [80]:
sr = pd.Series(**{"name":"animal_pop",
                  "index":["gorilla","orca","panda","rhino","lynx"],
                  "data":[1063,50_000,1864,19_600,76]})
sr

gorilla     1063
orca       50000
panda       1864
rhino      19600
lynx          76
Name: animal_pop, dtype: int64

In [81]:
# list-like
print(sr[3])
print(sr["panda"])

19600
1864

In [82]:
# iloc vs loc
## loc -> localize
## iloc -> index localize (index number, int)

sr.loc["panda"]

1864

In [83]:
sr.iloc[2]

1864

In [84]:
# Filtering with loc
sr.loc[sr < 2000]

gorilla    1063
panda      1864
lynx         76
Name: animal_pop, dtype: int64

In [85]:
lt2t = sr < 2000

In [86]:
sr.sort_values(ascending=False, inplace=True)

In [87]:
sr

orca       50000
rhino      19600
panda       1864
gorilla     1063
lynx          76
Name: animal_pop, dtype: int64

In [88]:
lt2t

gorilla     True
orca       False
panda       True
rhino      False
lynx        True
Name: animal_pop, dtype: bool

In [89]:
sr.loc[lt2t]

panda      1864
gorilla    1063
lynx         76
Name: animal_pop, dtype: int64

In [121]:
hab = pd.Series(**{"name":"animal_hab",
                  "index":["gorilla","orca","panda","rhino","lynx","kangooroo","giraffe"],
                  "data":["africa","ocean","asia","africa","europe","australia","africa"]})

In [122]:
hab == "africa"

gorilla       True
orca         False
panda        False
rhino         True
lynx         False
kangooroo    False
giraffe       True
Name: animal_hab, dtype: bool

In [123]:
sr[hab == "africa"]

rhino      19600
gorilla     1063
Name: animal_pop, dtype: int64

In [124]:
# Fail because there are indexes present in hab that are not in sr
hab[sr < 2000]

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

In [125]:
mask = hab.copy()

In [126]:
mask.iloc[:] = False

In [127]:
mask.loc[sr.index] = sr < 2000

In [128]:
mask

gorilla       True
orca         False
panda         True
rhino        False
lynx          True
kangooroo    False
giraffe      False
Name: animal_hab, dtype: object

In [129]:
hab[mask]

gorilla    africa
panda        asia
lynx       europe
Name: animal_hab, dtype: object

In [130]:
[att for att in dir(hab) if not att.startswith("_")]

['T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'argmax',
 'argmin',
 'argsort',
 'array',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'attrs',
 'autocorr',
 'axes',
 'backfill',
 'between',
 'between_time',
 'bfill',
 'bool',
 'clip',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'divmod',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtype',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'explode',
 'factorize',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'ge',
 'get',
 'giraffe',
 'gorilla',
 'groupby',
 'gt',
 'hasnans',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'isin',
 'isna',
 'isnull',
 'item',
 'items',
 'iteritems',
 'kangooroo',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'lynx',
 'mad',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'name',
 'nbytes',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'orca',
 'pad',
 'panda',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'ravel',
 'rdiv',
 'rdivmod',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'repeat',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rhino',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'searchsorted',
 'sem',
 'set_axis',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'squeeze',
 'std',
 'str',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_frame',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_list',
 'to_markdown',
 'to_numpy',
 'to_period',
 'to_pickle',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'unique',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'view',
 'where',
 'xs']

In [135]:
hab.value_counts()

africa       3
ocean        1
europe       1
australia    1
asia         1
Name: animal_hab, dtype: int64

In [136]:
hab.gorilla

'africa'

In [141]:
# ""set""
hab.unique()

array(['africa', 'ocean', 'asia', 'europe', 'australia'], dtype=object)

## DataFrame

In [144]:
df = pd.DataFrame(data={"pop":sr,"hab":hab})

In [146]:
# Print for DataFrames is kinda boring
print(df)

               pop        hab
giraffe        NaN     africa
gorilla     1063.0     africa
kangooroo      NaN  australia
lynx          76.0     europe
orca       50000.0      ocean
panda       1864.0       asia
rhino      19600.0     africa

In [148]:
display(df)

               pop        hab
giraffe        NaN     africa
gorilla     1063.0     africa
kangooroo      NaN  australia
lynx          76.0     europe
orca       50000.0      ocean
panda       1864.0       asia
rhino      19600.0     africa

In [153]:
df.loc["giraffe","pop"]

nan

In [157]:
import numpy as np
np.float64(None)

nan

In [165]:
df[(df["pop"] < 2000) & (df.hab == "europe")]

       pop     hab
lynx  76.0  europe

In [180]:
df.loc[df["pop"].notna(),"pop"].astype(np.int64,errors="ignore")

gorilla     1063
lynx          76
orca       50000
panda       1864
rhino      19600
Name: pop, dtype: int64

In [181]:
df

               pop        hab
giraffe        NaN     africa
gorilla     1063.0     africa
kangooroo      NaN  australia
lynx          76.0     europe
orca       50000.0      ocean
panda       1864.0       asia
rhino      19600.0     africa

In [182]:
df.columns

Index(['pop', 'hab'], dtype='object')

In [183]:
df.index

Index(['giraffe', 'gorilla', 'kangooroo', 'lynx', 'orca', 'panda', 'rhino'], dtype='object')

In [187]:
df.rename(columns={"hab":"habitat"},inplace=True)

In [188]:
df

               pop    habitat
giraffe        NaN     africa
gorilla     1063.0     africa
kangooroo      NaN  australia
lynx          76.0     europe
orca       50000.0      ocean
panda       1864.0       asia
rhino      19600.0     africa

In [190]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, giraffe to rhino
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   pop      5 non-null      float64
 1   habitat  7 non-null      object
dtypes: float64(1), object(1)
memory usage: 488.0+ bytes

In [191]:
df.describe()

                pop
count      5.000000
mean   14520.600000
std    21415.713385
min       76.000000
25%     1063.000000
50%     1864.000000
75%    19600.000000
max    50000.000000

In [197]:
df[(df["pop"]<2000) & (df["habitat"]=="asia")]

          pop habitat
panda  1864.0    asia

### and and & ; or and |
- `and`, `or` : conditional comparing
    - True and True : True
    - True and False : False
    - False and False : False
- `&`, `|` : bitwise operators

In [220]:
a = (df["pop"]<20000)
b = (df["habitat"]=="africa")

In [223]:
df[a&b]["pop"].sum()

20663.0

In [226]:
df[b].describe()

                pop
count      2.000000
mean   10331.500000
std    13107.638403
min     1063.000000
25%     5697.250000
50%    10331.500000
75%    14965.750000
max    19600.000000

In [229]:
df[b].std()

pop    13107.638403
dtype: float64

In [233]:
df.sort_values("pop",ascending=False)

               pop    habitat
orca       50000.0      ocean
rhino      19600.0     africa
panda       1864.0       asia
gorilla     1063.0     africa
lynx          76.0     europe
giraffe        NaN     africa
kangooroo      NaN  australia

In [237]:
df.sort_values("habitat")

               pop    habitat
giraffe        NaN     africa
gorilla     1063.0     africa
rhino      19600.0     africa
panda       1864.0       asia
kangooroo      NaN  australia
lynx          76.0     europe
orca       50000.0      ocean

In [241]:
df.sort_values(["habitat","pop"],ascending=[False,True])

               pop    habitat
orca       50000.0      ocean
lynx          76.0     europe
kangooroo      NaN  australia
panda       1864.0       asia
gorilla     1063.0     africa
rhino      19600.0     africa
giraffe        NaN     africa

### CSV
Comma-separated values

In [243]:
df = pd.read_csv("data/titanic.csv")
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [244]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1310 entries, 0 to 1309
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   float64
 1   survived   1309 non-null   float64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   float64
 6   parch      1309 non-null   float64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(7), object(7)
memory usage: 143.4+ KB

In [245]:
df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [252]:
df["survived"].value_counts()

0.0    809
1.0    500
Name: survived, dtype: int64

In [258]:
df.isnull().sum()

pclass          1
survived        1
name            1
sex             1
age           264
sibsp           1
parch           1
ticket          1
fare            2
cabin        1015
embarked        3
boat          824
body         1189
home.dest     565
dtype: int64

In [263]:
df.drop(index=[3,4,5]).head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [264]:
df.drop(columns=["name","cabin"])

,pclass,survived,sex,age,sibsp,parch,ticket,fare,embarked,boat,body,home.dest
0,1.0,1.0,female,29.0000,0.0,0.0,24160,211.3375,S,2,NaN,"St Louis, MO"
1,1.0,1.0,male,0.9167,1.0,2.0,113781,151.5500,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,female,2.0000,1.0,2.0,113781,151.5500,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,male,30.0000,1.0,2.0,113781,151.5500,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,female,25.0000,1.0,2.0,113781,151.5500,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,female,NaN,1.0,0.0,2665,14.4542,C,NaN,NaN,NaN
1306,3.0,0.0,male,26.5000,0.0,0.0,2656,7.2250,C,NaN,304.0,NaN
1307,3.0,0.0,male,27.0000,0.0,0.0,2670,7.2250,C,NaN,NaN,NaN
1308,3.0,0.0,male,29.0000,0.0,0.0,315082,7.8750,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [267]:
df.dropna(how="all", inplace=True)

In [271]:
df.tail(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5,0.0,0.0,2656,7.225,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0,0.0,0.0,2670,7.225,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0,0.0,0.0,315082,7.875,NaN,S,NaN,NaN,NaN

In [272]:
df.sort_values("fare")

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
363,2.0,0.0,"Campbell, Mr. William",male,NaN,0.0,0.0,239853,0.0000,NaN,S,NaN,NaN,Belfast
223,1.0,0.0,"Parr, Mr. William Henry Marsh",male,NaN,0.0,0.0,112052,0.0000,NaN,S,NaN,NaN,Belfast
170,1.0,1.0,"Ismay, Mr. Joseph Bruce",male,49.0,0.0,0.0,112058,0.0000,B52 B54 B56,S,C,NaN,Liverpool
1254,3.0,1.0,"Tornquist, Mr. William Henry",male,25.0,0.0,0.0,LINE,0.0000,NaN,S,15,NaN,NaN
896,3.0,0.0,"Johnson, Mr. Alfred",male,49.0,0.0,0.0,LINE,0.0000,NaN,S,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
302,1.0,1.0,"Ward, Miss. Anna",female,35.0,0.0,0.0,PC 17755,512.3292,NaN,C,3,NaN,NaN
50,1.0,1.0,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0.0,1.0,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Germantown, Philadelphia, PA"
49,1.0,1.0,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0.0,1.0,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA"
183,1.0,1.0,"Lesurer, Mr. Gustave J",male,35.0,0.0,0.0,PC 17755,512.3292,B101,C,3,NaN,NaN
1225,3.0,0.0,"Storey, Mr. Thomas",male,60.5,0.0,0.0,3701,NaN,NaN,S,NaN,261.0,NaN

In [276]:
df[df["sex"] == "male"]["age"].mean()

30.5852329787234

In [277]:
df[df["sex"] == "female"]["age"].mean()

28.6870706185567

In [292]:
df.groupby(by="sex").agg({"age":"mean","survived":sum})

              age  survived
sex
female  28.687071     339.0
male    30.585233     161.0